In [37]:
import pandas as pd
import numpy as np

In [38]:
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'], 
                   'FlightNumber':[10045,np.nan,10065,np.nan,10085],
                   'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                   'Airline':['KLM(!)','<Air France> (12)','(British Airways. )','12. Air France','"Swiss Air"']
                  
                  })

In [39]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Question-1-solution

In [40]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [41]:
df['FlightNumber'].interpolate(method='linear',order=10,inplace=True)

In [42]:
#the null values are successfully replaced with values 10 more tahn the previous ones
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [43]:
#changing the float-column into integer-column

df.astype({'FlightNumber' : 'int64'}).dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [44]:
#to make the above change permanent

df = df.astype({'FlightNumber' : 'int64'})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## Question-2-solution

In [45]:
#dividing a single column into two different columns by splitting the values on underscore _ delimiter

ft=[]
for i in df['From_To']:
     ft.append(i.split('_'))
ft        
p_from = []
p_to = []
for i in range(len(ft)):
    p_from.append(ft[i][0])
    p_to.append(ft[i][1])

In [46]:
df_temp = pd.DataFrame(p_from,columns=["From"])
df_temp["To"] = p_to
df_temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## Question-3-solution

In [47]:
#converting the string values into proper-case with 1st letter as capital and rest in small.

from_proper=[]
to_proper=[]
for i in df_temp['From']:
    from_proper.append(i[0].upper()+i[1:].lower())
for j in df_temp['To']:
    to_proper.append(j[0].upper()+j[1:].lower())

In [48]:
df_temp['From'] = from_proper
df_temp['To'] = to_proper

In [49]:
df_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## Question-4-solution

In [50]:
#deleting the column 'From_To'

df.drop(['From_To'],axis=1,inplace=True)

In [51]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [52]:
#joining the temporary 'From' & 'To' dataframe to the original dataframe

df = df_temp.join(df)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

## Question-5-solution

In [53]:
delays_list=df['RecentDelays']

In [54]:
all_len=[]
for i in delays_list:
    all_len.append(len(i))
col_max_len = max(all_len)
col_max_len

3

In [55]:
for i in delays_list:
    list_len=len(i)
    if list_len<col_max_len:
        for j in range(col_max_len-list_len):
            i.append(np.nan)

In [56]:
delays_list

0      [23, 47, nan]
1    [nan, nan, nan]
2       [24, 43, 87]
3     [13, nan, nan]
4      [67, 32, nan]
Name: RecentDelays, dtype: object

In [57]:
all_len = len(all_len)

In [58]:
delay_0=[]
delay_1=[]
delay_2=[]
for i in range(all_len):
        delay_0.append(delays_list[i][0])
        delay_1.append(delays_list[i][1])
        delay_2.append(delays_list[i][2])

In [59]:
new_df = pd.DataFrame([delay_0,delay_1,delay_2]).transpose()
new_df=new_df.rename(columns={0:'Delay_1',1:'Delay_2',2:'Delay_3'})
new_df

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [60]:
df.drop('RecentDelays',axis=1,inplace=True)

In [61]:
df=df.join(new_df)
df

,From,To,FlightNumber,Airline,Delay_1,Delay_2,Delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN